jobs/20260726-221504-luqia-vllm-gate-ablation-on-l4-uncapped/slurm-250156.out

===== scheduler_sweep_with_saturation_gate =====
workload_source=Dual_Sweep_LLM_Phase2_common_measured_grid
slo_ttft_ms=500 slo_tpot_ms=200 saturation_threshold=0.30
saturation_model=five_seed_mean_local_retrained_75
placement=l40s-prefill-l4-decode
overload_action=min-slo-violation
online_scheduling=true max_l4_freq=none max_l40s_freq=2520
kv_effective_bandwidth_gbps=disabled kv_num_layers=32 kv_num_heads=8 kv_head_dim=128 kv_bytes_per_element=2 dispatch_ms=0
clock_mismatch_action=continue clock_ack_mode=monitor clock_ack_transport=http_with_file_fallback
scheduler_enabled=true active_scheduler_policy=latency_plus_saturation gpu_clock_control_mode=manual policy_label=gate_on_latency_plus_saturation_l4_uncapped
scheduler_workload seq=1 id=steady_start il=32 ol=32 rate=1 online=true active_policy=latency_plus_saturation
scheduler_selected seq=1 policy=latency_plus_saturation status=OK prefill=neptune:480 decode=ganymede:360 predicted_cluster_power_w=147.8

===== allocation =====
time=2026-07-26T22:16:47+02:00
batch_host=ganymede
SLURM_JOB_ID=250156
SLURM_JOB_NODELIST=ganymede,neptune
model=mistralai/Mistral-7B-v0.1 workload_count=12 slurm_time_limit=00:28:00
ganymede
neptune
JobId=250156 JobName=20260726-221504-luqia-vllm-gate-ablation-on-l4-uncapped
   UserId=chjing(10271) GroupId=root(0) MCS_label=N/A
   Priority=1 Nice=0 Account=student QOS=normal
   JobState=RUNNING Reason=None Dependency=(null)
   Requeue=1 Restarts=0 BatchFlag=1 Reboot=0 ExitCode=0:0
   RunTime=00:00:01 TimeLimit=01:00:00 TimeMin=N/A
   SubmitTime=2026-07-26T22:16:46 EligibleTime=2026-07-26T22:16:46
   AccrueTime=2026-07-26T22:16:46
   StartTime=2026-07-26T22:16:46 EndTime=2026-07-26T23:16:46 Deadline=N/A
   SuspendTime=None SecsPreSuspend=0 LastSchedEval=2026-07-26T22:16:46 Scheduler=Backfill
   Partition=long AllocNode:Sid=minerva:919086
   ReqNodeList=ganymede,neptune ExcNodeList=(null)
   NodeList=ganymede,neptune
   BatchHost=ganymede
   NumNodes=2 NumCPUs=256 NumTasks=2 CPUs/Task=16 ReqB:S:C:T=0:0:*:*
   ReqTRES=cpu=16,mem=128G,node=2,billing=16,gres/gpu=2
   AllocTRES=cpu=256,mem=128G,node=2,billing=256,gres/gpu=4,gres/gpu:l4=8,gres/gpu:l40s=4
   Socks/Node=* NtasksPerN:B:S:C=1:0:*:* CoreSpec=*
   MinCPUsNode=16 MinMemoryNode=64G MinTmpDiskNode=0
   Features=(null) DelayBoot=00:00:00
   OverSubscribe=NO Contiguous=0 Licenses=(null) Network=(null)
   Command=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260726-221504-luqia-vllm-gate-ablation-on-l4-uncapped/run.sbatch
   WorkDir=/data/users/chjing/Sweep_LLM_Jobs_broker
   StdErr=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260726-221504-luqia-vllm-gate-ablation-on-l4-uncapped/slurm-250156.err
   StdIn=/dev/null
   StdOut=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260726-221504-luqia-vllm-gate-ablation-on-l4-uncapped/slurm-250156.out
   Power=
   TresPerNode=gres/gpu:1
   TresPerTask=cpu:8
   


===== 100gbe_and_environment_preflight =====
[NVGPUFREQ][INFO] The spank nvgpufreq plugin has been loaded!
[NVGPUFREQ][ERROR] Failed to retrive the job ID from slurmctld! Exit!
host=ganymede node_group=ganymede role=decode mode=preflight
scheduled_gpu=l4 scheduled_freq_mhz=360 gpu_id=0
gpu_clock_control_mode=manual
clock_ack_mode=monitor
node_ip=10.1.0.3 peer_ip=10.1.0.6 interface=eno12399np0
CUDA_VISIBLE_DEVICES=0
eno12399np0      UP             10.1.0.3/16 fe80::632:1ff:fe4d:80/64 
10.1.0.6 dev eno12399np0 src 10.1.0.3 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
host=neptune node_group=neptune role=prefill mode=preflight
scheduled_gpu=l40s scheduled_freq_mhz=480 gpu_id=0
gpu_clock_control_mode=manual
clock_ack_mode=monitor
node_ip=10.1.0.6 peer_ip=10.1.0.3 interface=enp160s0f0np0
CUDA_VISIBLE_DEVICES=0
index, name, memory.total [MiB], driver_version
0, NVIDIA L4, 23034 MiB, 595.71.05
1, NVIDIA L4, 23034 MiB, 595.71.05
2, NVIDIA L4, 23034 MiB, 595.71.05
3, NVIDIA L4, 23034 MiB, 595.71.05
4, NVIDIA L4, 23034 MiB, 595.71.05
5, NVIDIA L4, 23034 MiB, 595.71.05
6, NVIDIA L4, 23034 MiB, 595.71.05
7, NVIDIA L4, 23034 MiB, 595.71.05
enp160s0f0np0    UP             10.1.0.6/16 fe80::6e92:cfff:fe5e:cc00/64 
10.1.0.3 dev enp160s0f0np0 src 10.1.0.6 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
index, name, memory.total [MiB], driver_version
0, NVIDIA L40S, 46068 MiB, 595.71.05
1, NVIDIA L40S, 46068 MiB, 595.71.05
2, NVIDIA L40S, 46068 MiB, 595.71.05
3, NVIDIA L40S, 46068 MiB, 595.71.05
host=ganymede import=torch version=2.9.1+cu128
host=ganymede import=vllm version=0.15.1
host=ganymede import=aiohttp version=3.13.3
host=ganymede import=msgpack version=1.1.2
host=ganymede import=zmq version=27.1.0
host=neptune import=torch version=2.9.1+cu128
host=neptune import=vllm version=0.15.1
host=neptune import=aiohttp version=3.13.3
host=neptune import=msgpack version=1.1.2
host=neptune import=zmq version=27.1.0
preflight_rc=0

===== start_proxy =====
proxy_pid=1816163
waiting name=proxy elapsed_s=5 url=http://127.0.0.1:30156/health
ready name=proxy elapsed_s=5 url=http://127.0.0.1:30156/health

===== start_prefill_and_decode_once =====
server_step_pid=1816170
waiting name=prefill elapsed_s=5 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=10 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=15 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=20 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=25 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=30 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=35 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=40 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=45 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=50 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=55 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=60 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=65 url=http://10.1.0.6:32156/v1/models
waiting name=prefill elapsed_s=70 url=http://10.1.0.6:32156/v1/models
ready name=prefill elapsed_s=70 url=http://10.1.0.6:32156/v1/models
ready name=decode elapsed_s=0 url=http://10.1.0.3:33156/v1/models

===== wait_for_pd_registry =====
{"prefill": ["10.1.0.6:32156"], "decode": ["10.1.0.3:33156"]}
registry_ready=true

===== pd_smoke_request =====
smoke_curl_rc=0
vllm_burstiness_supported=true

===== multi_workload_bench =====

===== workload_1_steady_start =====
workload_start time=2026-07-26T22:18:13+02:00 seq=1 id=steady_start il=32 ol=32 request_rate=1 window_seconds=12 burstiness=1.0 description=low_rate_poisson_start
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=480 ganymede_decode_mhz=360 predicted_cluster_power_w=147.8
clock_request seq=1 neptune_mhz=480 ganymede_mhz=360
clock_ack seq=1 node_group=neptune target_mhz=480 rc=0 observed_mhz=480 verification_mode=monitor transport=http
clock_ack seq=1 node_group=ganymede target_mhz=360 rc=0 observed_mhz=360 verification_mode=monitor transport=http
bench_config num_prompts=12 nominal_window_s=12 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0
energy_event unix_ts=1785097153.491732246 event=workload_start seq=1 workload_id=steady_start
energy_event unix_ts=1785097191.797251156 event=workload_end seq=1 workload_id=steady_start
bench_rc=0 seq=1 id=steady_start
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7007fb775120>, seed=0, num_prompts=12, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=32, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30156', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-fc53a11b-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-26 22:19:34 [datasets.py:612] Sampling input_len from [31, 31] and output_len from [32, 32]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:02<00:00,  2.11s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 12/12 [00:14<00:00,  1.18s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     12        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  14.21     
Total input tokens:                      372       
Total generated tokens:                  384       
Request throughput (req/s):              0.84      
Output token throughput (tok/s):         27.02     
Peak output token throughput (tok/s):    51.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          53.20     
---------------Time to First Token----------------
Mean TTFT (ms):                          244.91    
Median TTFT (ms):                        248.77    
P99 TTFT (ms):                           290.05    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          63.90     
Median TPOT (ms):                        64.38     
P99 TPOT (ms):                           64.78     
---------------Inter-token Latency----------------
Mean ITL (ms):                           63.90     
Median ITL (ms):                         64.14     
P99 ITL (ms):                            74.23     
==================================================
bench_request_counts seq=1 id=steady_start successful=12 failed=0

===== online_scheduler_window_2_short_ramp =====
scheduler_workload seq=2 id=short_ramp il=32 ol=32 rate=4 online=true active_policy=latency_plus_saturation
scheduler_selected seq=2 policy=latency_plus_saturation status=OK prefill=neptune:210 decode=ganymede:360 predicted_cluster_power_w=161.7

===== workload_2_short_ramp =====
workload_start time=2026-07-26T22:19:52+02:00 seq=2 id=short_ramp il=32 ol=32 request_rate=4 window_seconds=12 burstiness=1.5 description=rate_jump_with_moderate_burstiness
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=210 ganymede_decode_mhz=360 predicted_cluster_power_w=161.7
clock_request seq=2 neptune_mhz=210 ganymede_mhz=360
clock_ack seq=2 node_group=neptune target_mhz=210 rc=0 observed_mhz=480 verification_mode=monitor transport=http
clock_ack seq=2 node_group=ganymede target_mhz=360 rc=0 observed_mhz=360 verification_mode=monitor transport=http
bench_config num_prompts=48 nominal_window_s=12 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.5
energy_event unix_ts=1785097193.642994719 event=workload_start seq=2 workload_id=short_ramp
energy_event unix_ts=1785097224.352618758 event=workload_end seq=2 workload_id=short_ramp
bench_rc=0 seq=2 id=short_ramp
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x759f9aeb5120>, seed=0, num_prompts=48, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=32, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30156', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4.0, burstiness=1.5, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-fb0a70fb-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-26 22:20:07 [datasets.py:612] Sampling input_len from [31, 31] and output_len from [32, 32]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:02<00:00,  2.07s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.5 (Gamma distribution)
Maximum request concurrency: 16
100%|██████████| 48/48 [00:14<00:00,  3.33it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     48        
Failed requests:                         0         
Maximum request concurrency:             16        
Request rate configured (RPS):           4.00      
Benchmark duration (s):                  14.40     
Total input tokens:                      1488      
Total generated tokens:                  1536      
Request throughput (req/s):              3.33      
Output token throughput (tok/s):         106.67    
Peak output token throughput (tok/s):    207.00    
Peak concurrent requests:                21.00     
Total token throughput (tok/s):          210.01    
---------------Time to First Token----------------
Mean TTFT (ms):                          322.09    
Median TTFT (ms):                        312.67    
P99 TTFT (ms):                           426.90    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.84     
Median TPOT (ms):                        68.40     
P99 TPOT (ms):                           71.82     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.84     
Median ITL (ms):                         68.18     
P99 ITL (ms):                            85.98     
==================================================
bench_request_counts seq=2 id=short_ramp successful=48 failed=0

===== online_scheduler_window_3_prefill_shift =====
scheduler_workload seq=3 id=prefill_shift il=128 ol=32 rate=3 online=true active_policy=latency_plus_saturation
scheduler_selected seq=3 policy=latency_plus_saturation status=OK prefill=neptune:480 decode=ganymede:570 predicted_cluster_power_w=177.2

===== workload_3_prefill_shift =====
workload_start time=2026-07-26T22:20:25+02:00 seq=3 id=prefill_shift il=128 ol=32 request_rate=3 window_seconds=12 burstiness=2.0 description=input_length_shift
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=480 ganymede_decode_mhz=570 predicted_cluster_power_w=177.2
clock_request seq=3 neptune_mhz=480 ganymede_mhz=570
clock_ack seq=3 node_group=neptune target_mhz=480 rc=0 observed_mhz=210 verification_mode=monitor transport=http
clock_ack seq=3 node_group=ganymede target_mhz=570 rc=0 observed_mhz=360 verification_mode=monitor transport=http
bench_config num_prompts=36 nominal_window_s=12 timeout_s=300 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=2.0
energy_event unix_ts=1785097226.285333929 event=workload_start seq=3 workload_id=prefill_shift